Revit 2024 API
BuiltInFailures.DecalFailures.LongerThanPossible Property
 Decal element is longer than the circumference of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LongerThanPossible { get; }
Visual Basic
Public Shared ReadOnly Property LongerThanPossible As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LongerThanPossible {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DecalFailures Class
Autodesk.Revit.DB Namespace